{
  "posts": [
    {
      "title": "Kenya ",
      "content": "Kenya,[a] officially the Republic of Kenya,[b] is a country located in East Africa. With an estimated population of more than 52.4 million as of mid-2024,[13] Kenya is the 27th-most-populous country in the world[7] and the 7th most populous in Africa. Kenya's capital and largest city is Nairobi. Its second-largest and oldest city is Mombasa, a major port city located on Mombasa Island. Other major cities within the country include Kisumu, Nakuru & Eldoret. Going clockwise, Kenya is bordered by South Sudan to the northwest (though much of that border includes the disputed Ilemi Triangle), Ethiopia to the north, Somalia to the east, the Indian Ocean to the southeast, Tanzania to the southwest, and Lake Victoria and Uganda to the west.  Kenya's geography, climate and population vary widely. In western, rift valley counties, the landscape includes cold, snow-capped mountaintops (such as Batian, Nelion and Point Lenana on Mount Kenya) with vast surrounding forests, wildlife and fertile agricultural regions to temperate climates. In other areas, there are dry, arid and semi-arid climates as well as absolute deserts (such as Chalbi Desert and Nyiri Desert).  Kenya's earliest inhabitants included some of the first humans to evolve from ancestral members of the genus Homo. Ample fossil evidence for this evolutionary history has been found at Koobi Fora. Later, Kenya was inhabited by hunter-gatherers similar to the present-day Hadza people.[14][15] According to archaeological dating of associated artifacts and skeletal material, Cushitic speakers first settled in the region's lowlands between 3,200 and 1,300 BC, a phase known as the Lowland Savanna Pastoral Neolithic. Nilotic-speaking pastoralists (ancestral to Kenya's Nilotic speakers) began migrating from present-day South Sudan into Kenya around 500 BC.[16] Bantu people settled at the coast and the interior between 250 BC and 500 AD.[17]  European contact began in 1500 AD with the Portuguese Empire, and effective colonisation of Kenya began in the 19th century during the European exploration of Africa. Modern-day Kenya emerged from a protectorate established by the British Empire in 1895 and the subsequent Kenya Colony, which began in 1920. Mombasa was the capital of the British East Africa Protectorate,[18] which included most of what is now Kenya and southwestern Somalia, from 1889 to 1907. Numerous disputes between the UK and the colony led to the Mau Mau revolution, which began in 1952, and the declaration of Kenya's independence in 1963. After independence, Kenya remained a member of the Commonwealth of Nations. The country's current constitution was adopted in 2010, replacing the previous 1963 constitution.  Kenya is a presidential representative democratic republic, in which elected officials represent the people and the president is the head of state and government.[19] The country is a member of the United Nations, the Commonwealth, World Bank, International Monetary Fund, World Trade Organization, COMESA, International Criminal Court, as well as several other international organisations. It is also a major non-NATO ally of the United States.  Kenya's economy is the largest in East and Central Africa, with Nairobi serving as a major regional commercial hub.[20] With a Gross National Income of $2,110, [21] the country is a lower-middle-income economy. Agriculture is the country's largest economic sector; tea and coffee are the sector's traditional cash crops, while fresh flowers are a fast-growing export. The service industry, particularly tourism, is also one of the country's major economic drivers. Kenya is a member of the East African Community trade bloc,[22][23] though some international trade organisations categorise it as part of the Greater Horn of Africa.[24] Africa is Kenya's largest export market, followed by the European Union.[25]",
      "author": "Nick",
      "id": 2
    },
    {
      "title": "kenya",
      "content": "Kenya,[a] officially the Republic of Kenya,[b] is a country located in East Africa. With an estimated population of more than 52.4 million as of mid-2024,[13] Kenya is the 27th-most-populous country in the world[7] and the 7th most populous in Africa. Kenya's capital and largest city is Nairobi. Its second-largest and oldest city is Mombasa, a major port city located on Mombasa Island. Other major cities within the country include Kisumu, Nakuru & Eldoret. Going clockwise, Kenya is bordered by South Sudan to the northwest (though much of that border includes the disputed Ilemi Triangle), Ethiopia to the north, Somalia to the east, the Indian Ocean to the southeast, Tanzania to the southwest, and Lake Victoria and Uganda to the west.  Kenya's geography, climate and population vary widely. In western, rift valley counties, the landscape includes cold, snow-capped mountaintops (such as Batian, Nelion and Point Lenana on Mount Kenya) with vast surrounding forests, wildlife and fertile agricultural regions to temp",
      "author": "Nick",
      "id": 3
    }
  ],
  "comments": [],
  "profile": {
    "name": "typicode"
  }
}